import 'package:sabak9/text.dart';
import 'package:sabak9/user_model.dart';
import 'package:sabak9/user.dart';

const String tajrybajolu1 =
    '   Токтогул Сатылганов Жалал-Абад облусунун Кетмен-Төбөсүндө туулган. Он үч жашынан эле айыл арасында ырдай баштаган. Акындын лирикалык жанрдагы "Алымкан", "Насылкан", "Кызыл жоолук" аттуу ырлары күнү бүгүнкүгө чейин өзүнүн баасын жоготпой ырдалып келет.1910-жылы алыскы сүргүндөн качып чыккан Токтогул мекенине совет бийлиги менен тең чамалаш жеткен деп айтылат анын өмүр баяны жөнүндө түрдүү булактарда. Эл үмүтүн жандырган жаңы замандын келишин даңазалаган ырлар ошол кездеги Токтогулдун чыгармачылыгынын өзөгүн түзүп, анын ырлары элдин добушуна айланат. 1938-жылы алгачкы ырлар жыйнагы жарык көргөн. Кийин ырларынын эки томдугу кыргызча, эки томдугу орусча, бир томдугу французча чыгарылган. 1933-жылы 69-жаш курагында туулган жеринде дүйнөдөн кайткан.';

const String tajrybajolu2 =
    'Байымбет Абдракман уулу/Абдыракманов (Тоголок Молдо) — 1860-жылы Ак-Талаа районундагы Куртка деген айылда туулган. Атасынан 14 жашында ажырап, андан кийин аталаш агасы Музооке ырчыны ээрчип, ошонун тарбиясында жүргөн.Баскан-турганын, уккан билгенин баарын кагазга түшүрүп жүргөн Тоголок Молдо анын баарын 1916-жылкы үркүндө жоготуп жиберген. Анан 1936-жылдан тартып кайра баштан киришкен. “Манастын” өз вариантын да ал өзү кагазга түшүргөн.Тоголок Молдо 1937-жылдан тартып 1941-жылга чейин Кыргыз Илимдер академиясына “Манас” үчилтигинен 98 703 сап ыр тапшырган.Өз дооруунда сейрек кездешкен сабаттуу адамдардын бири, балдар адабияты үчүн кайталангыс чыгармаларды калтырган жазгыч акын, ошону менен эле бирге төкмө, манасчы Тоголок Молдо 1942-жылы өзү туулган Куртка айылында каза болгон.';
const String tajrybajolu3 =
    'Ырчы, төкмө акын Өтө Көкө уулу 1860-жылы Талас өрөөнүндө Кара-Буура районундагы Жийде айлында туулган. Анын айылын азыркы Кыргызстандын Талас облусуна караштуу Манас районундагы Сары-Көбөн айылы катары да көрсөтүшөт[1].Ал кыргыздын кытай уруусунун чоодан уругунан болгон.Жашынан томолой жетим калып, Аксы, Анжиян тараптагы таякелеринде, кийин Кара-Суу кыштагындагы жакын таякеси Айныкеникинде жүргөн.Чогулган эл кемсел кийген жаш ырчынын аты-жөнүн билбегендиктен, "Бул жеңи жок таап айтты. Жеңи жок кыйын ырчы экен!" дешип, ошондон тартып баягы ырчы Жеңижок аталып, элге таанылган. [2]Жеңижок заманачыл акын жана ойчул Арстанбек Буйлаш уулунун да батасын алган.Жеңижок 1918-жылы Жаңы-Жолдо (Аксыда) дүйнөдөн кайткан.';
const String tajrybajolu4 =
    '1883-жылы Жумгалдын Кара-Ой деген жеринде кедейдин үй-бүлөсүндө туулган. Калыктын улуу Токтогулга жолугушу, андан үлгү алышы — анын шыгынын артылышына чоң таасир эткен. Айыл кеңешинин төрагасы, филармонияда артист болуп иштеген.Акындын чыгармалары Совет бийлиги орногондон кийин жарык көргөн. Биринчи ырлар жыйнагы «Калыктын ырлары» деген наам менен 1936-жылы китеп болуп басылып чыккан. Анын айтуусу боюнча «Жаныш-Байыш», «Курманбек» өңдүү элдик дастандар 1938-жылы жарыяланган. Өмүр жолун баяндаган «Баскан жол» деген көлөмдүү китепти эскерме катары жазып калтырган.Кыргыз маданиятын өстүрүүдө сиңирген эмгеги үчүн К. Акыев Эмгек Кызыл Туу, «Ардак Белгиси» ордендери, медалдар, Кыргыз ССР Жогорку Советинин Президиумунун Ардак грамотасы менен сыйланган. Ага 1939-жылы «Кыргыз ССРинин эл артисти» деген наам берилген.';
const String tajrybajolu5 =
    'Эстебес Турсуналиев — 1931-жылы 5-майда Талас облусунун Манас районуна караштуу Кара-Арча айылында туулган. Анын атасы Турсуналы комузду жакшы черткен. Энеси Арпаян оозеки чыгармаларды мыкты билген жомокчу, кошокчу болгон. Эстебес 9 жашында комуз чертүүнү үйрөнүп, 12 жашынан баштап өздүк-көркөм чыгармачылык ийримдерине, райондук, областтык жана республикалык кароолорго жигердүү катышып келген.Эстебес Турсуналиев филармониядагы 60 жылга чукул чыгармачылык өмүрүндө төкмөлүк өнөр менен айкалыштырып, "Акындын үнү", "Айтыштар", "Заман жарчысы", "Эскерүүлөр", "Ыр өмүрүм”, "Кайыңды" аттуу китептери жарыкка чыгарган.Ага Кыргыз Мамлекеттик кон-серваториясынын фольклор бөлүмүнүн профессору деген наам ыйгарыл-ган.«Ардак белгиси» ордени, «1941–1945-жылдардагы Улуу Ата Мекендик согуштагы каарман эмгеги үчүн», В.И.Лениндин туулган күнүнүн 100 жылдыгынын урматына «Каарман эмгеги үчүн» медалы, Кыргыз ССРинин Жогорку Советинин Ардак грамоталары менен сыйланган.Ал 2005-жылы 11-октябрда кан басым оорусунан 74 жаш курагында дүйнө салган.';
const String tajrybajolu6 =
    'Барпы Алыкулов (1884-1949) Жалал-Абад облусуна караштуу Сузак районунун Ачы кыштагында 1884-жылы дүйнөгө келди. Атасы Алыкул, анын атасы Шамурза тегинен жарды, кембагалдын тукуму болгондуктан, ар кимге жалчы жүрүп өмүр өткөрүштү. Барпы да эс тартканы Мадалы, Назарбай деген байлардын малын багып, отунун алып, күлүн чыгарды.Кийин Ысакбайда малай болуп жүргɵн.Барпы отуздан өткөнгө чейин малайлыкта жүрүп, Октябрь төңкөрүшү жеңгенден кийин гана эркин, өз алдынча жашады. Алдыңкылардан болуп жаны турмушту түптөп, көч башында болду. Союз кошчу жана өз ара көмөктөшүү топторунда кызмат өтөп, айыл кеңешинин орун басары да болуп жүрдү. Өткөн оор турмуш өз таасирин бердиби, Барпы 36 жаш курагында катуу ооруга чалдыгып эки көзү тең бүдөмүктөп калат.Даанышман акын 1949- жылы 9- ноябрында Фрунзе шаарында (азыркы Бишкек шаары) дүйнөдөн кайтты. Сөөгү калаанын түндүгүндөгү Ала-Арча көрүстөнүнө коюлган.';

final List<User> users = [
  User(
    aty: 'Токтогул Сатылганов',
    kesibi: 'Kыргыз төкмө акыны, обончу, комузчу, аткаруучу, куудул, дастанчы.',
    jashy: '25-октябрь 1864 — 17-февраль 1933-жылы',
    profilesurot: 'images/sat.jpg',
    tajrybajolu: tajrybajolu1,
  ),
  User(
    aty: 'Тоголок Молдо',
    kesibi:
        '(нукура ысымы — Байымбет Абдыракман уулу) — Кыргыз элинен чыккан жазма акын жана манасчы.',
    jashy: '10-июнь 1860— 4-январь 1942 жж.',
    profilesurot: 'images/image2.jpg',
    tajrybajolu: tajrybajolu2,
  ),
  User(
    aty: 'Жени Жок',
    kesibi:
        'Көкө уулу Жеңижок (туулганда берилген ысымы — Өтө) же Жеңижок  — кыргыздын залкар төкмө акыны.',
    jashy: '1860—1918',
    profilesurot: 'images/image3.jpg',
    tajrybajolu: tajrybajolu3,
  ),
  User(
    aty: 'Калык Акиев',
    kesibi: 'Кыргыздын атактуу акыны.',
    jashy: '1883-1953-жылдын 3-ноябры',
    profilesurot: 'images/image4.jpg',
    tajrybajolu: tajrybajolu4,
  ),
  User(
    aty: 'Эстебес Турсуналиев',
    kesibi:
        'Кара-Арча айылы (Талас облусу) , Бишкек) — белгилүү акын, төкмө акын, комузчу. СССРдин эл артисти (1988-ж.)',
    jashy: '5-май, 1931-жыл — 11-октябрь, 2005-жыл',
    profilesurot: 'images/image5.jpg',
    tajrybajolu: tajrybajolu5,
  ),
  User(
    aty: 'Барпы Алыкулов',
    kesibi: 'Кыргыз эл акындарынын эң мыктыларынын бири.',
    jashy: '1884-1949 жж.',
    profilesurot: 'images/image6.jpg',
    tajrybajolu: tajrybajolu6,
  ),
];
